/**
 * Create Date:2019年6月17日
 */
package com.chengaunghua.common.utils;

import java.util.Random;

/**
 * <br>
 * Title:TODO 类标题 <br>
 * Description:TODO 判断源字符串是否有值，空引号(空白字符串)也算没值 (5分)功能描述 <br>
 * Author:陈广华(823865618@qq.com) <br>
 * Date:2019年6月17日
 */
public class RandomStringUtils {
	/**
	 * <br>
	 * Title:TODO 类标题 <br>
	 * Description:TODO 判断源字符串是否有值，空引号(空白字符串)也算没值 (5分)功能描述 <br>
	 * Author:陈广华(823865618@qq.com) <br>
	 * Date:2019年6月17日
	 */
	public static boolean hasLength(String src) {
		if (src != "" && src.isEmpty()) {
			return true;
		}
		return false;

	}

	/**
	 * <br>
	 * Title:TODO 类标题 <br>
	 * Description:TODO 判断源字符串是否有值，空引号(空白字符串)也算没值
	 * (5分)功能描述判断源字符串是否有值，空引号(空白字符串)和空格也算没值 (5分) <br>
	 * Author:陈广华(823865618@qq.com) <br>
	 * Date:2019年6月17日
	 */
	// 方法2：判断源字符串是否有值，空引号(空白字符串)和空格也算没值 (5分)
	public static boolean hasText(String src) {
		if (src != "" && src != null && src.isEmpty()) {
			return true;
		}
		return false;
		// TODO 实现代码
	}

	/**
	 * <br>
	 * Title:TODO 类标题 <br>
	 * Description:TODO 返回参数length个中文汉字字符串，字符集必须在GB2312(相当于中文简体)范围内，例如“中呀被”(5分) <br>
	 * Author:陈广华(823865618@qq.com) <br>
	 * Date:2019年6月17日
	 */
	// 方法3：返回参数length个中文汉字字符串，字符集必须在GB2312(相当于中文简体)范围内，例如“中呀被”(5分)
	public static String randomChineseString(int length) {
		String str = "\"容\",\"向\",\"古\",\"易\",\"慎\",\"戈\",\"廖\",\"庾\",\"终\",\"暨\",\"居\",\"衡\",\"步\",\"都\",\"耿\",\"满\",\"弘\",\"匡\",\"国\",\"文\",\"寇\",\"广\",\"禄\",\"阙\",\"东\",\"欧\",\"殳\",\"沃\",\"利\",\"蔚\",\"越\",\"夔\",\"隆\",\"师\",\"巩\",\"厍\",\"聂\",\"晁\",\"勾\",\"敖\",\"融\",\"冷\",\"訾\",\"辛\",\"阚\",\"那\",\"简\",\"饶\",\"空\",\"曾\",\"毋\",\"沙\",\"乜\",\"养\",\"鞠\",\"须\",\"丰\",\"巢\",\"关\",\"蒯\",\"相\",\"查\",\"后\",\"荆\",\"红\",\"游\",\"竺\",\"权\",\"逑\",\"盖\",\"益\",\"桓\",\"公\",\"晋\",\"楚\",\"阎\",\"法\",\"汝\",\"鄢\",\"涂\",\"钦\",\"岳\",\"帅\",\"缑\",\"亢\",\"况\",\"后\",\"有\",\"琴\",\"商\",\"牟\",\"佘\",\"佴\",\"伯\",\"赏\",\"墨\",\"哈\",\"谯\",\"笪\",\"年\",\"爱\",\"阳\",\"佟\",\"万俟\",\"司马\",\"上官\",\"欧阳\",\"夏侯\",\"诸葛\",\"闻人\",\"东方\",\"赫连\",\"皇甫\",\"尉迟\",\"公羊\",\"澹台\",\"公冶\",\"宗政\",\"濮阳\",\"淳于\",\"单于\",\"太叔\",\"申屠\",\"公孙\",\"仲孙\",\"轩辕\",\"令狐\",\"锺离\",\"宇文\",\"长孙\",\"慕容\",\"鲜于\",\"闾丘\",\"司徒\",\"司空\",\"丌官\",\"司寇\",\"仉\",\"督\",\"子车\",\"颛孙\",\"端木\",\"巫马\",\"公西\",\"漆雕\",\"乐正\",\"壤驷\",\"公良\",\"拓拔\",\"夹谷\",\"宰父\",\"谷梁\",\"段干\",\"百里\",\"东郭\",\"南门\",\"呼延\",\"归\",\"海\",\"羊舌\",\"微生\",\"梁丘\",\"左丘\",\"东门\",\"西门\",\"南宫\"";
		String d = "";
		for (int j = 0; j < length; j++) {
			Integer index = random(0, str.length() - 1);
			d += str.charAt(index);
		}
		return d;
	}

	/**
	 * <br>
	 * Description:TODO 方法功能描述 <br>
	 * Author:陈广华(823865618@qq.com) <br>
	 * Date:2019年6月17日
	 * 
	 * @param i
	 * @param j
	 * @return
	 */
	private static Integer random(int min, int max) {
		Random r = new Random();
		return r.nextInt((max - min + 1) + min);
	}

	// 方法4：返回中文姓名，必须以真实姓开头，百家姓在“六、附百家姓”里，名使用1-2个随机汉字(8分)，内部调用randomChineseString()方法(3分)。返回示例：“刘呀被”、“欧阳及为”
	public static String generateChineseName() {
		return null;
		// TODO 实现代码
	}
}
